
        ; --- ждать появления изменения сигнала ---
        ld  c,  #01

retr:   ld  de, $4001       10
-----------------------------------
@@      in  a, (#fe)        11        # прием
        nop                 4
        and c               4
        jr  z, exit         7
        inc e               4
        and d               4        # отсечь микрофон
        xor b               4        # проверка изменения
        jp  z, @b           10
------------------------------------ 48T*(E+1)
        ld  b, a            4        # новое значение
        ld  (hl), e         7
        inc hl              6
        ld  a, h            4
        cp  $fe             7
        jp  nz, retr        10

        ; memory out
