
; Текущая позиция курсора в teletype режиме
TPCHRX:             equ $5B00   ; 0..63
TPCHRY:             equ $5B01   ; 0..23

; ----------------------------------------------------------------------
TIMER_TICK:         equ $5B02   ; $5B02 Показатель таймера (WORD)
TIMER_BLINK:        equ $5B04   ; $5B04 Диапазон курсора 0..49                                
CURSOR_BLINKED:     equ $5B05   ; $5B05 0=курсора нет, 1=курсор есть

; ----------------------------------------------------------------------
KEYB_NUMKEY:        equ $5B06   ; $5B06 Количество символов в буфере
; xxx7 CURSOR_DISABLE: equ $5B07
KEYB_STATUS:        equ $5B08   ; 8 байт на 8 строк (64 кнопки)
KEYB_BUFFER:        equ $5B10   ; 16 байт Одновременно зажаты 8 кнопок могут быть

KBD_REPEAT_FIRST:   equ 30      ; тиков на первый повтор
KBD_REPEAT_SECOND:  equ 5       ; тиков на второй повтор

; ----------------------------------------------------------------------
DOS_CMD:            equ $5B20   ; 64 байт (буфер)
DOS_LEN:            equ $5B60   ; Размер буфера (0..63)

