// ---------------------------------------------------------------------
// Объявление регистров
// ---------------------------------------------------------------------

// Основной набор
reg [ 7:0]  b = 8'h00;
reg [ 7:0]  c = 8'h00;
reg [ 7:0]  d = 8'h00;
reg [ 7:0]  e = 8'h00;
reg [ 7:0]  h = 8'h00;
reg [ 7:0]  l = 8'h00;
reg [ 7:0]  a = 8'h00;
reg [ 7:0]  f = 8'h00;
reg [ 7:0]  i = 8'h00;
reg [ 7:0]  r = 8'h00;

// Управляющие регистры
reg [15:0]  pc = 16'h0000;
reg [15:0]  sp = 16'hdffe;
reg [15:0]  ix = 16'h0000;
reg [15:0]  iy = 16'h0000;
reg [ 1:0]  imode = 2'b00;
reg         iff1;
reg         iff2;

// 8x8 Дополнительный набор регистров
reg [63:0]  prime;

// ---------------------------------------------------------------------
// Внутреннее состояние процессора
// ---------------------------------------------------------------------

// Фаза исполнения инструкции
reg [ 4:0]  t_state = 1'b0;

// Указатель шины. Если =1, то указывает на `cc`, иначе на `pc`
reg         bus = 1'b0;

// `cc` current cursor, указатель на память в случае bus=1
reg [15:0]  cc  = 16'h00;

// Задержка при получении данных от шины
reg [ 2:0]  latency = 2'h2;

// Защелка для хранения последнего опкода
reg [ 7:0]  opcode  = 8'hFF;

// Конвейер
reg [ 7:0]  d0; // Более поздние данные
reg [ 7:0]  d1; // Более ранние

// ---------------------------------------------------------------------
// Инициализация
// ---------------------------------------------------------------------

initial begin

    W  = 1'b0;
    DO = 8'h00;

end
