<?php

$lookup = [
    [ 0, 32,  8, 40,  2, 34, 10, 42],
    [48, 16, 56, 24, 50, 18, 58, 26],
    [12, 44,  4, 36, 14, 46,  6, 38],
    [60, 28, 52, 20, 62, 30, 54, 22],
    [ 3, 35, 11, 43,  1, 33,  9, 41],
    [51, 19, 59, 27, 49, 17, 57, 25],
    [15, 47,  7, 39, 13, 45,  5, 37],
    [63, 31, 55, 23, 61, 29, 53, 21],
];

$output = "";

$m    = 32; // Среднее значение (2^5)
$base = 96;

for ($base = 96; $base <= 160; $base += 8) {

    echo "[ $base ]\n";

    // [96..128..159]
    for ($y = 0; $y < 8; $y++) {

        $byte = 0;
        for ($x = 0; $x < 8; $x++) {

            $g = $base + ($lookup[$y][$x] - $m);

            $bit = $g >= 128 ? 1 : 0;
            $byte = ($byte << 1) | $bit;
            echo "$bit ";
        }

        echo sprintf(": $%02X\n", $byte);
        $output .= chr($byte);
    }
}

file_put_contents("../dither.bin", $output);
