#ifndef NO_SDL
#include "SDL.h"
#endif

/**
 * -a Автостарт с командой RUN
 * -o <файл> Вывод серии PNG в файл (если - то stdout)
 * -c Запускать без GUI SDL
 * <file>.(z80|tap) Загрузка снашпота или TAP бейсика
 * -M <секунды> длительность записи
 * -b [последовательность символов нажатий клавиш]
 * -s Пропуск повторяющегося кадра
 * -2 Включить режим 128к
 * -w wav-файл для записи звука
 */

#include <sys/timeb.h>
#include <unistd.h>
#include <fcntl.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>

#include "lodepng.cc"

#ifndef NO_SDL
#define MAX_AUDIOSDL_BUFFER 882*16

// Циклический буфер
int           AudioSDLFrame;
int           AudioZXFrame;
unsigned char ZXAudioBuffer[MAX_AUDIOSDL_BUFFER];

// Аудиобуфер
void sdl_audio_buffer(void* udata, unsigned char* stream, int len) {

    // Выдача данных
    for (int i = 0; i < 882; i++) {

        int v = ZXAudioBuffer[882*AudioSDLFrame + i];
        stream[i] = v;
    }

    // К следующему (если можно)
    if (AudioSDLFrame != AudioZXFrame) {
        AudioSDLFrame = (AudioSDLFrame + 1) % 16;
    }
    // Если догнал - то отстать на несколько кадров
    else {
        AudioSDLFrame = ((AudioZXFrame + 16) - 8) % 16;
    }
}
#endif

// Для выгрузки BMP https://ru.wikipedia.org/wiki/BMP

static const int ay_levels[16] = {
    0x0000, 0x0385, 0x053D, 0x0770,
    0x0AD7, 0x0FD5, 0x15B0, 0x230C,
    0x2B4C, 0x43C1, 0x5A4B, 0x732F,
    0x9204, 0xAFF1, 0xD921, 0xFFFF
};

// 14 байт
struct __attribute__((__packed__)) BITMAPFILEHEADER {
    unsigned short bfType;      // BM
    unsigned int   bfSize;      // 38518
    unsigned short bfReserved1; // 0
    unsigned short bfReserved2; // 0
    unsigned int   bfOffBits;   // 0x76
};

// 40 байт
struct __attribute__((__packed__)) BITMAPINFOHEADER {
    unsigned int   biSize;          // 0x28 (40)
    unsigned int   biWidth;         // 320
    unsigned int   biHeight;        // 240
    unsigned short biPlanes;        // 1
    unsigned short biBitCount;      // 4
    unsigned int   biCompression;   // 0
    unsigned int   biSizeImage;     // 0x9600 (38400)
    unsigned int   biXPelsPerMeter; // 0x0B13
    unsigned int   biYPelsPerMeter; // 0x0B13
    unsigned int   biClrUsed;       // 0x10 (16)
    unsigned int   biClrImportant;  // 0
};

// 44 байта https://audiocoding.ru/articles/2008-05-22-wav-file-structure/
struct __attribute__((__packed__)) WAVEFMTHEADER {

    unsigned int    chunkId;        // RIFF 0x52494646
    unsigned int    chunkSize;
    unsigned int    format;         // WAVE 0x57415645
    unsigned int    subchunk1Id;    // fmt (0x666d7420)
    unsigned int    subchunk1Size;  // 16
    unsigned short  audioFormat;    // 1
    unsigned short  numChannels;    // 2
    unsigned int    sampleRate;     // 44100
    unsigned int    byteRate;       //
    unsigned short  blockAlign;     //
    unsigned short  bitsPerSample;  //
    unsigned int    subchunk2Id;    // data 0x64617461
    unsigned int    subchunk2Size;  // Количество байт в области данных.

};

// 4x16 = 64 байта занимает таблица цветов

// Видимая область: 224 x 312 = 69888 t-states
// Общая область: 352x296

class Z80Spectrum : public Z80 {
protected:

#ifndef NO_SDL
    SDL_Event       event;
    SDL_Surface*    sdl_screen;
    SDL_AudioSpec   audio_device;
#endif
    int             sdl_enable;
    int             width, height;
    unsigned char   fb[160*240];        // Следующий кадр
    unsigned char   pb[160*240];        // Предыдущий кадр
    unsigned char   memory[128*1024];   // 128k
    unsigned char   rom[65536];         // 4 ROM

