#ifndef NO_SDL
#include "SDL.h"
#endif

/**
 * -a Автостарт с командой RUN
 * -o <файл> Вывод серии PNG в файл (если - то stdout)
 * -c Запускать без GUI SDL
 * <file>.(z80|tap) Загрузка снашпота или TAP бейсика
 * -M <секунды> длительность записи
 * -b [последовательность символов нажатий клавиш]
 * -s Пропуск повторяющегося кадра
 * -2 Включить режим 128к
 */

#include <sys/timeb.h>
#include <unistd.h>
#include <fcntl.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>

#include "lodepng.cc"

// Для выгрузки BMP https://ru.wikipedia.org/wiki/BMP

// 14 байт
struct __attribute__((__packed__)) BITMAPFILEHEADER {
    unsigned short bfType;      // BM
    unsigned int   bfSize;      // 38518
    unsigned short bfReserved1; // 0
    unsigned short bfReserved2; // 0
    unsigned int   bfOffBits;   // 0x76
};

// 40 байт
struct __attribute__((__packed__)) BITMAPINFOHEADER {
    unsigned int   biSize;          // 0x28 (40)
    unsigned int   biWidth;         // 320
    unsigned int   biHeight;        // 240
    unsigned short biPlanes;        // 1
    unsigned short biBitCount;      // 4
    unsigned int   biCompression;   // 0
    unsigned int   biSizeImage;     // 0x9600 (38400)
    unsigned int   biXPelsPerMeter; // 0x0B13
    unsigned int   biYPelsPerMeter; // 0x0B13
    unsigned int   biClrUsed;       // 0x10 (16)
    unsigned int   biClrImportant;  // 0
};

// 4x16 = 64 байта занимает таблица цветов

// Видимая область: 224 x 312 = 69888 t-states
// Общая область: 352x296

class Z80Spectrum : public Z80 {
protected:

#ifndef NO_SDL
    SDL_Event       event;
    SDL_Surface*    sdl_screen;
#endif
    int             sdl_enable;
    int             width, height;
    unsigned char   fb[160*240];        // Следующий кадр
    unsigned char   pb[160*240];        // Предыдущий кадр
    unsigned char   memory[128*1024];   // 128k
    unsigned char   rom[65536];         // 4 ROM

    // Таймер обновления экрана
    unsigned int    ms_time_diff;
    struct timeb    ms_clock;
    unsigned int    ms_clock_old;

    int   flash_state, flash_counter;
    uint  border_id;
    int   key_states[8];
    int   t_states_cycle;

    // Консольная запись
    int   con_frame_start, con_frame_end, con_frame_fps;
    int   con_pngout;
    int   diff_prev_frame;
